hisatomi/anatock/app/controllers/stocks_controller.rb

  def index
   @stocks = Stock.paginate(:page => params[:page], :per_page => 20)
---
SELECT COUNT(*) FROM `stocks`