hisatomi/anatock/app/controllers/stocks_controller.rb

  def index
    @page = 1
    @pages = [1,2,3,4,5]
    @stocks = Stock.order("num")
    @Pstocks = @stocks.limit(20)
    @market = Stock.select("market").uniq
---
SELECT `stocks`.* FROM `stocks` ORDER BY num LIMIT 20 OFFSET 0
SELECT DISTINCT business FROM `stocks`

  def show
    @stock = Stock.find(2)
---
SELECT `stocks`.* FROM `stocks` WHERE `stocks`.`id` = 685 LIMIT 1